# Intro to Pandas 
&copy; QuantSprout

Import the pandas package

In [22]:
import pandas as pd
pd.__version__

u'0.18.1'

Create a simple DataFrame

In [23]:
df = pd.DataFrame({'name':['Bob','Jen','Tim'],
                   'age':[20,30,40],
                   'pet':['cat', 'dog', 'bird']})

df

   age name   pet
0   20  Bob   cat
1   30  Jen   dog
2   40  Tim  bird

View the column names and index values

In [24]:
print df.columns
print df.index

Index([u'age', u'name', u'pet'], dtype='object')
RangeIndex(start=0, stop=3, step=1)

Select a column by name in 2 different ways

In [25]:
print df['name']
print df.name

0    Bob
1    Jen
2    Tim
Name: name, dtype: object
0    Bob
1    Jen
2    Tim
Name: name, dtype: object

Select multiple columns

In [26]:
print df[['name','pet']]

  name   pet
0  Bob   cat
1  Jen   dog
2  Tim  bird

Select a row by index

In [27]:
print df.ix[0]

age      20
name    Bob
pet     cat
Name: 0, dtype: object

Sort the data by pet

In [28]:
df.sort_values('pet',inplace=True, ascending=True)

View the index after the sort

In [29]:
print df

   age name   pet
2   40  Tim  bird
0   20  Bob   cat
1   30  Jen   dog

Difference between ix and iloc

In [30]:
print df.ix[0]
print df.iloc[0]

age      20
name    Bob
pet     cat
Name: 0, dtype: object
age       40
name     Tim
pet     bird
Name: 2, dtype: object

Use iloc to select all rows of a column

In [31]:
print df.iloc[:,2]

2    bird
0     cat
1     dog
Name: pet, dtype: object

Use iloc to select the last row

In [32]:
df.iloc[-1,:]

age      30
name    Jen
pet     dog
Name: 1, dtype: object

### Exercises

In [46]:
sales = [100,130,119,92,35]
customer_account = ['B100','J101','X102','P103','R104']
city = ['BOS','LA','NYC','SF','CHI']

Create a DataFrame with the data above

In [47]:
df = pd.DataFrame({'sales':sales, 'customer':customer_account, 
                   'city':city})

In [48]:
print df

  city customer  sales
0  BOS     B100    100
1   LA     J101    130
2  NYC     X102    119
3   SF     P103     92
4  CHI     R104     35

What is the name of the first column?

In [49]:
print df.columns[0]
print df.city
print df['city']

city
0    BOS
1     LA
2    NYC
3     SF
4    CHI
Name: city, dtype: object
0    BOS
1     LA
2    NYC
3     SF
4    CHI
Name: city, dtype: object

Sort the DataFrame by city in descending order (check the documentation for sort)

In [51]:
df.sort_values('city',ascending=False,inplace=True)
print df

  city customer  sales
3   SF     P103     92
2  NYC     X102    119
1   LA     J101    130
4  CHI     R104     35
0  BOS     B100    100

Which customer is in the last row of the DataFrame?

In [43]:
print df.iloc[-1,1]
print df.customer.iloc[-1]

B100
B100

#### Bonus
Reorder the columns with customer in the first column

In [ ]:
df = df[['customer','city','sales']]
print df

Rename a column

In [ ]:
df.columns = ['customer', 'city_name', 'sales_amount']
print df

In [20]:
df.rename(columns={'customer':'customer_account'},inplace=True)
print df

  customer_account city_name  sales_amount
3             P103        SF            92
2             X102       NYC           119
1             J101        LA           130
4             R104       CHI            35
0             B100       BOS           100

## Importing and Exporting Data with Pandas

#### Reading and Writing CSV Files

Open the test_pandas.csv file as a dataframe

In [21]:
data = pd.read_csv('test_pandas.csv')
print data

   Column A Column B  Column C
0         1      cat       1.1
1         2      dog       2.2
2         3     bird       3.3

Write the data to a csv file without the headers

In [22]:
data.to_csv('test_pandas_no_header.csv', header=False, index=True)

Open the test_pandas_no_header.csv file

In [23]:
data_no_header = pd.read_csv('test_pandas_no_header.csv') 
print data_no_header

   0  1   cat  1.1
0  1  2   dog  2.2
1  2  3  bird  3.3

Try opening the file with header set to None

In [24]:
data_no_header = pd.read_csv('test_pandas_no_header.csv', header=None) 
print data_no_header

   0  1     2    3
0  0  1   cat  1.1
1  1  2   dog  2.2
2  2  3  bird  3.3

#### Reading and writing Excel files

Reading Excel files is similar.  Just add worksheet you want to read.

In [25]:
data = pd.read_excel('test_pandas.xlsm', 'Sheet1')
print data

   Column A Column B  Column C
0         1      cat       1.1
1         2      dog       2.2
2         3     bird       3.3

For writing to an Excel file, you need to use a writer object.  This enables you to save multiple dataframes as separate sheets in the same file.  File doesn't get created until you save.

In [26]:
writer = pd.ExcelWriter('test_sheets.xlsx')

data.to_excel(writer,'Original')
data.to_excel(writer,'Copy')

writer.save()

#### Reading and writing SQL

To read and write to SQL you need to establish a connection to a database.  Each type of database is different, so you'll have to do some research to find the exact code for your version of SQL.  Here is an example for sqlite.

In [27]:
import sqlite3
conn = sqlite3.connect('test_pandas.db')

Use the connection for importing a query as a DataFrame

In [28]:
sql_query = "SELECT * FROM test"
data = pd.read_sql(sql_query,conn)
print data

    id           city    mascot
0    1  San Francisco     49ers
1    2        Oakland   Raiders
2    3        Seattle  Seahawks
3    4        Chicago     Bears
4    5            NYC      Jets
5    6   Philadelphia    Eagles
6    7          Miami  Dolphins
7    6   Philadelphia    Eagles
8    7          Miami  Dolphins
9    6   Philadelphia    Eagles
10   7          Miami  Dolphins
11   6   Philadelphia    Eagles
12   7          Miami  Dolphins
13   6   Philadelphia    Eagles
14   7          Miami  Dolphins

Create new DataFrame to load into SQL Database

In [29]:
new_data = pd.DataFrame({'id':[6,7], 'city':['Philadelphia', 'Miami'],'mascot':['Eagles','Dolphins']})
new_data = new_data[['id','city','mascot']]
print new_data

   id          city    mascot
0   6  Philadelphia    Eagles
1   7         Miami  Dolphins

Create new table in SQL

In [30]:
new_data.to_sql('test_new_table',conn,if_exists='append',index=False)

Append to existing table in SQL.  Ensure that column names need to match the names in the data table to which you're loading the information

In [31]:
new_data.to_sql('test',conn,if_exists='append',index=False)

Don't forget to close connection

In [32]:
conn.close()

## Exploring Titanic Data Set with Pandas

In [53]:
import pandas as pd

Load the train.csv file as a DataFrame

In [54]:
data = pd.read_csv('train.csv')

Investigate the first few rows of data

In [55]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Investigate the last 10 rows of data

In [56]:
data.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

Investigate the data types in the DataFrame

In [57]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

Get some summary statistics

In [58]:
data.describe().T

/Users/Craig_Sakuma/anaconda/lib/python2.7/site-packages/numpy/lib/function_base.py:3834: RuntimeWarning: Invalid value encountered in percentile
  RuntimeWarning)

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,NaN,NaN,NaN,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

Filter the data for men

In [59]:
data[data.Sex=='male']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
29,30,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,PC 17604,82.1708,NaN,C
35,36,0,1,"Holverson, Mr. Alexander Oskar",male,42.0,1,0,113789,52.0000,NaN,S
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C
37,38,0,3,"Cann, Mr. Ernest Charles",male,21.0,0,0,A./5. 2152,8.0500,NaN,S
42,43,0,3,"Kraeff, Mr. Theodor",male,NaN,0,0,349253,7.8958,NaN,C
45,46,0,3,"Rogers, Mr. William John",male,NaN,0,0,S.C./A.4. 23567,8.0500,NaN,S
46,47,0,3,"Lennon, Mr. Denis",male,NaN,1,0,370371,15.5000,NaN,Q
48,49,0,3,"Samaan, Mr. Youssef",male,NaN,2,0,2662,21.6792,NaN,C
50,51,0,3,"Panula, Master. Juha Niilo",male,7.0,4,1,3101295,39.6875,NaN,S
51,52,0,3,"Nosworthy, Mr. Richard Cater",male,21.0,0,0,A/4. 39886,7.8000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S
57,58,0,3,"Novel, Mr. Mansouer",male,28.5,0,0,2697,7.2292,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
840,841,0,3,"Alhomaki, Mr. Ilmari Rudolf",male,20.0,0,0,SOTON/O2 3101287,7.9250,NaN,S
841,842,0,2,"Mudd, Mr. Thomas Charles",male,16.0,0,0,S.O./P.P. 3,10.5000,NaN,S
843,844,0,3,"Lemberopolous, Mr. Peter L",male,34.5,0,0,2683,6.4375,NaN,C
844,845,0,3,"Culumovic, Mr. Jeso",male,17.0,0,0,315090,8.6625,NaN,S
845,846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.5500,NaN,S
846,847,0,3,"Sage, Mr. Douglas Bullen",male,NaN,8,2,CA. 2343,69.5500,NaN,S
847,848,0,3,"Markoff, Mr. Marin",male,35.0,0,0,349213,7.8958,NaN,C
848,849,0,2,"Harper, Rev. John",male,28.0,0,1,248727,33.0000,NaN,S
850,851,0,3,"Andersson, Master. Sigvard Harald Elias",male,4.0,4,2,347082,31.2750,NaN,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
857,858,1,1,"Daly, Mr. Peter Denis",male,51.0,0,0,113055,26.5500,E17,S
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
860,861,0,3,"Hansen, Mr. Claus Peter",male,41.0,2,0,350026,14.1083,NaN,S
861,862,0,2,"Giles, Mr. Frederick Edward",male,21.0,1,0,28134,11.5000,NaN,S
864,865,0,2,"Gill, Mr. John William",male,24.0,0,0,233866,13.0000,NaN,S
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
870,871,0,3,"Balkic, Mr. Cerin",male,26.0,0,0,349248,7.8958,NaN,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
876,877,0,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

Filter the ages for the men

In [60]:
data.Age[data.Sex=='male']

0      22.0
4      35.0
5       NaN
6      54.0
7       2.0
12     20.0
13     39.0
16      2.0
17      NaN
20     35.0
21     34.0
23     28.0
26      NaN
27     19.0
29      NaN
30     40.0
33     66.0
34     28.0
35     42.0
36      NaN
37     21.0
42      NaN
45      NaN
46      NaN
48      NaN
50      7.0
51     21.0
54     65.0
55      NaN
57     28.5
       ...
840    20.0
841    16.0
843    34.5
844    17.0
845    42.0
846     NaN
847    35.0
848    28.0
850     4.0
851    74.0
857    51.0
859     NaN
860    41.0
861    21.0
864    24.0
867    31.0
868     NaN
869     4.0
870    26.0
872    33.0
873    47.0
876    20.0
877    19.0
878     NaN
881    33.0
883    28.0
884    25.0
886    27.0
889    26.0
890    32.0
Name: Age, dtype: float64

How many men and women were on the Titanic?

In [61]:
print data.Sex[data.Sex=='male'].count()
print data.Sex[data.Sex=='female'].count()

577
314

What was the survival rate for adult men (age>=18)

In [62]:
data.Survived[(data.Sex=='male')&(data.Age>=18)].mean()

0.17721518987341772

What was the survival rate for women and children?

In [63]:
data.Survived[(data.Sex=='female')|(data.Age<18)].mean()

0.6881720430107527

Use groupby to compare the survival rates of men and women

In [64]:
data.groupby('Sex')['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

Create a DataFrame with groupby and view the index

In [79]:
new = data.groupby(['Sex','Pclass'])['Survived','Age'].mean()
print new.index
print new

MultiIndex(levels=[[u'female', u'male'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]],
           names=[u'Sex', u'Pclass'])
               Survived        Age
Sex    Pclass
female 1       0.968085  34.611765
       2       0.921053  28.722973
       3       0.500000  21.750000
male   1       0.368852  41.281386
       2       0.157407  30.740707
       3       0.135447  26.507589

Reset the index

In [80]:
new.reset_index(inplace=True)

View again

In [81]:
print new.index
print new

RangeIndex(start=0, stop=6, step=1)
      Sex  Pclass  Survived        Age
0  female       1  0.968085  34.611765
1  female       2  0.921053  28.722973
2  female       3  0.500000  21.750000
3    male       1  0.368852  41.281386
4    male       2  0.157407  30.740707
5    male       3  0.135447  26.507589

## Exercises

What was the average age of the survivors?

In [68]:
print data.Age[data.Survived==1].mean()

28.3436896552

What was the combined survival rate of both children (age less than 18) and seniors (age greater than 60)?

In [69]:
print data.Survived[(data.Age<18)|(data.Age>=60)].mean()

0.489208633094

Group by pClass and investigate average survival rate, age and fare

In [83]:
# data.groupby('Pclass')['Age','Survived','Fare'].mean()
data.groupby(['Sex','Pclass'])['Age','Survived','Fare'].mean()

                     Age  Survived        Fare
Sex    Pclass
female 1       34.611765  0.968085  106.125798
       2       28.722973  0.921053   21.970121
       3       21.750000  0.500000   16.118810
male   1       41.281386  0.368852   67.226127
       2       30.740707  0.157407   19.741782
       3       26.507589  0.135447   12.661633

Create an Excel file with the names and ages of the surivors on one tab and the names and ages of the deceased in another tab

In [71]:
writer = pd.ExcelWriter('titanic_survivors.xlsx')
survived = data[['Name','Age']][data.Survived==1]
survived.to_excel(writer,'Survivors')
data[['Name','Age']][data.Survived==0].to_excel(writer,
                                                'Deceased',
                                                index=False)

writer.save()

Create a csv file with the count of passengers by Pclass

In [87]:
pclass_count = data.groupby('Pclass')['Name'].count()
print type(pclass_count)
pclass_count = pd.DataFrame(pclass_count)
pclass_count.reset_index(inplace=True)
pclass_count.rename(columns={'Name':'Count_of_Names'},inplace=True)
# print pclass_count
# pclass_count.to_csv('count of pclass.csv')

<class 'pandas.core.series.Series'>

In [73]:
pclass_count

   Pclass  Count_of_Names
0       1             216
1       2             184
2       3             491